from random import *

q = 1
us = 0
pc = 0

while q:

    print(f'победы человека: {us}, победы пк: {pc}')
    a = str(input('введите "камень", "ножницы" или "бумага":'))
    aa = ["камень", "ножницы", "бумага"]
    b = choice(aa)
    print(f'пк выбрал: {b}')

    c = 0 # 1 - ничья 2 - победа человека 3 - победа пк

    if a == "камень" and b == "камень": c = 1
    if a == "камень" and b == "ножницы": c = 2
    if a == "камень" and b == "бумага": c = 3

    if a == "ножницы" and b == "камень": c = 3
    if a == "ножницы" and b == "ножницы": c = 1
    if a == "ножницы" and b == "бумага": c = 2

    if a == "бумага" and b == "камень": c = 2
    if a == "бумага" and b == "ножницы": c = 3
    if a == "бумага" and b == "бумага": c = 1

    if c == 1:
        print('ничья')
    if c == 2:
        print('вы победили в ходе')
        us +=1
    if c == 3:
        print('вы проиграли в ходе')
        pc += 1

    if us == 3:
        print('вы победили в игре')
        q = 0
    if pc == 3:
        print('вы проиграли в игре')
        q = 0